<?php

return [
    'password_confirm' => [
        'heading' => 'تأیید رمز عبور',
        'description' => 'لطفاً رمز عبور خود را برای تکمیل این عملیات تأیید کنید.',
        'current_password' => 'رمز عبور فعلی',
    ],
    'two_factor' => [
        'heading' => 'چالش دو مرحله‌ای',
        'description' => 'لطفاً با وارد کردن کد احراز هویت ارائه شده توسط برنامه تأیید کننده، دسترسی خود به حساب کاربری را تأیید کنید.',
        'code_placeholder' => 'XXX-XXX',
        'recovery' => [
            'heading' => 'چالش دو مرحله‌ای',
            'description' => 'لطفاً با وارد کردن یکی از کدهای اضطراری بازیابی، دسترسی خود به حساب کاربری را تأیید کنید.',
        ],
        'recovery_code_placeholder' => 'abcdef-98765',
        'recovery_code_text' => 'دستگاهتان گم شده؟',
        'recovery_code_link' => 'استفاده از کد بازیابی',
        'back_to_login_link' => 'بازگشت به صفحه ورود',
    ],
    'profile' => [
        'account' => 'حساب کاربری',
        'profile' => 'پروفایل',
        'my_profile' => 'پروفایل من',
        'subheading' => 'پروفایل کاربری خود را در اینجا مدیریت کنید.',
        'personal_info' => [
            'heading' => 'اطلاعات شخصی',
            'subheading' => 'اطلاعات شخصی خود را مدیریت کنید.',
            'submit' => [
                'label' => 'به‌روزرسانی',
            ],
            'notify' => 'پروفایل با موفقیت به‌روزرسانی شد!',
        ],
        'password' => [
            'heading' => 'رمز عبور',
            'subheading' => 'باید حداقل ۸ کاراکتر باشد.',
            'submit' => [
                'label' => 'به‌روزرسانی',
            ],
            'notify' => 'رمز عبور با موفقیت به‌روزرسانی شد!',
        ],
        '2fa' => [
            'title' => 'احراز هویت دو مرحله‌ای',
            'description' => 'مدیریت احراز هویت دو مرحله‌ای برای حساب کاربری خود (توصیه می‌شود).',
            'actions' => [
                'enable' => 'فعال سازی',
                'regenerate_codes' => 'تجدید کدها',
                'disable' => 'غیرفعال سازی',
                'confirm_finish' => 'تأیید و پایان',
                'cancel_setup' => 'لغو راه‌اندازی',
            ],
            'setup_key' => 'کلید راه‌اندازی',
            'must_enable' => 'برای استفاده از این برنامه باید احراز هویت دو مرحله‌ای را فعال کنید.',
            'not_enabled' => [
                'title' => 'شما احراز هویت دو مرحله‌ای را فعال نکرده‌اید.',
                'description' => 'هنگام فعال کردن احراز هویت دو مرحله‌ای، هنگام ورود به سیستم به شما درخواست یک توکن امن و تصادفی می‌شود. این توکن را می‌توانید از برنامه احراز هویت گوگل در تلفن همراه خود دریافت کنید.',
            ],
            'finish_enabling' => [
                'title' => 'پایان دادن به فعال‌سازی احراز هویت دو مرحله‌ای.',
                'description' => 'برای پایان دادن به فعال‌سازی احراز هویت دو مرحله‌ای، کد QR زیر را با استفاده از برنامه احراز هویت تلفن همراه خود اسکن کنید یا کلید راه‌اندازی را وارد کرده و کد OTP تولید شده را وارد کنید.',
            ],
            'enabled' => [
                'notify' => 'احراز هویت دو مرحله‌ای فعال شد.',
                'title' => 'شما احراز هویت دو مرحله‌ای را فعال کرده‌اید!',
                'description' => 'احراز هویت دو مرحله‌ای هم‌اکنون فعال است. این کمک می‌کند تا حساب کاربری شما ایمن‌تر شود.',
                'store_codes' => 'این کدها می توانند برای بازیابی دسترسی به حساب شما در صورت گم شدن دستگاه استفاده شوند. هشدار! این کدها فقط یک بار نمایش داده می شوند.',
            ],
            'disabling' => [
                'notify' => 'احراز هویت دو مرحله‌ای غیرفعال شده است.',
            ],
            'regenerate_codes' => [
                'notify' => 'کدهای بازیابی جدید ایجاد شده است.',
            ],
            'confirmation' => [
                'success_notification' => 'کد تأیید شد. احراز هویت دو مرحله‌ای فعال شد.',
                'invalid_code' => 'کد وارد شده نامعتبر است.',
            ],
        ],
        'sanctum' => [
            'title' => 'توکن‌های API',
            'description' => 'توکن‌های API را مدیریت کنید که به سرویس‌های شخص ثالث اجازه می‌دهند از طرف شما به این برنامه دسترسی داشته باشند.',
            'create' => [
                'notify' => 'توکن با موفقیت ایجاد شد!',
                'message' => 'توکن شما تنها یک بار پس از ایجاد نشان داده می شود. اگر توکن خود را گم کردید، باید آن را حذف کرده و یک توکن جدید ایجاد کنید.',
                'submit' => [
                    'label' => 'ايجاد',
                ],
            ],
            'update' => [
                'notify' => 'توکن با موفقیت به روز شد!',
            ],
            'copied' => [
                'label' => 'من توکنم رو کپی کردم',
            ],
        ],
    ],
    'clipboard' => [
        'link' => 'کپی به کلیپ‌بورد',
        'tooltip' => 'کپی شد!',
    ],
    'fields' => [
        'avatar' => 'آواتار',
        'email' => 'ایمیل',
        'login' => 'ورود',
        'name' => 'نام',
        'password' => 'رمز عبور',
        'password_confirm' => 'تایید رمز عبور',
        'new_password' => 'رمز عبور جدید',
        'new_password_confirmation' => 'تایید رمز عبور جدید',
        'token_name' => 'نام توکن',
        'token_expiry' => 'انقضاء توکن',
        'abilities' => 'توانایی ها',
        '2fa_code' => 'کد',
        '2fa_recovery_code' => 'کد بازیابی',
        'created' => 'ایجاد شده',
        'expires' => 'انقضاء',
    ],
    'or' => 'یا',
    'cancel' => 'لغو',
];
