<?php

return [
    "login" => [
        "username_or_email" => "نام کاربری یا ایمیل",
        "forgot_password_link" => "رمز عبور را فراموش کرده‌اید؟",
        "create_an_account" => "ایجاد حساب کاربری",
    ],
    "password_confirm" => [
        "heading" => "تأیید رمز عبور",
        "description" => "لطفاً رمز عبور خود را برای تکمیل این عملیات تأیید کنید.",
        "current_password" => "رمز عبور فعلی"
    ],
    "two_factor" => [
        "heading" => "چالش دو عاملی",
        "description" => "لطفاً با وارد کردن کد احراز هویت ارائه شده توسط برنامه تأیید کننده، دسترسی خود به حساب کاربری را تأیید کنید.",
        "code_placeholder" => "XXX-XXX",
        "recovery" => [
            "heading" => "چالش دو عاملی",
            "description" => "لطفاً با وارد کردن یکی از کدهای اضطراری بازیابی، دسترسی خود به حساب کاربری را تأیید کنید.",
        ],
        "recovery_code_placeholder" => "abcdef-98765",
        "recovery_code_text" => "دستگاهتان گم شد؟",
        "recovery_code_link" => "استفاده از کد بازیابی",
        "back_to_login_link" => "بازگشت به صفحه ورود"
    ],
    "registration" => [
        "title" => "ثبت نام",
        "heading" => "ایجاد حساب کاربری جدید",
        "submit" => [
            "label" => "ثبت نام",
        ],
        "notification_unique" => "یک حساب کاربری با این ایمیل از قبل وجود دارد. لطفاً وارد شوید.",
    ],
    "reset_password" => [
        "title" => "فراموشی رمز عبور",
        "heading" => "بازیابی رمز عبور",
        "submit" => [
            "label" => "ارسال",
        ],
        "notification_error" => "خطا در بازیابی رمز عبور. لطفاً درخواست بازنشانی رمز عبور جدید ارسال کنید.",
        "notification_error_link_text" => "دوباره امتحان کنید",
        "notification_success" => "صندوق ورودی خود را برای دستورالعمل‌ها بررسی کنید!",
    ],
    "verification" => [
        "title" => "تأیید ایمیل",
        "heading" => "تأیید ایمیل الزامی است",
        "submit" => [
            "label" => "خروج",
        ],
        "notification_success" => "صندوق ورودی خود را برای دستورالعمل‌ها بررسی کنید!",
        "notification_resend" => "ایمیل تأییدیه مجدداً ارسال شده است.",
        "before_proceeding" => "قبل از ادامه، لطفاً برای دریافت لینک تأیید، ایمیل خود را بررسی کنید.",
        "not_receive" => "اگر ایمیل را دریافت نکرده‌اید،",
        "request_another" => "اینجا را کلیک کنید تا یکی دیگر را درخواست کنید",
    ],
    "profile" => [
        "account" => "حساب کاربری",
        "profile" => "پروفایل",
        "my_profile" => "پروفایل من",
        "personal_info" => [
            "heading" => "اطلاعات شخصی",
            "subheading" => "مدیریت اطلاعات شخصی خود را.",
            "submit" => [
                "label" => "به‌روزرسانی",
            ],
            "notify" => "پروفایل با موفقیت به‌روزرسانی شد!",
        ],
        "password" => [
            "heading" => "رمز عبور",
            "subheading" => "باید حداقل ۸ کاراکتر باشد.",
            "submit" => [
                "label" => "به‌روزرسانی",
            ],
            "notify" => "رمز عبور با موفقیت به‌روزرسانی شد!",
        ],
        "2fa" => [
            "title" => "احراز هویت دو عاملی",
            "description" => "مدیریت احراز هویت دو عاملی برای حساب کاربری خود (توصیه می‌شود).",
            "actions" => [
                "enable" => "فعال سازی",
                "regenerate_codes" => "تجدید کدها",
                "disable" => "غیرفعال سازی",
                "confirm_finish" => "تأیید و پایان",
                "cancel_setup" => "لغو راه‌اندازی"
            ],
            "setup_key" => "کلید راه‌اندازی",
            "not_enabled" => [
                "title" => "شما احراز هویت دو عاملی را فعال نکرده‌اید.",
                "description" => "هنگام فعال کردن احراز هویت دو عاملی، هنگام ورود به سیستم به شما درخواست یک توکن امن و تصادفی می‌شود. این توکن را می‌توانید از برنامه احراز هویت گوگل در تلفن همراه خود دریافت کنید."
            ],
            "finish_enabling" => [
                "title" => "پایان دادن به فعال‌سازی احراز هویت دو عاملی.",
                "description" => "برای پایان دادن به فعال‌سازی احراز هویت دو عاملی، کد QR زیر را با استفاده از برنامه احراز هویت تلفن همراه خود اسکن کنید یا کلید راه‌اندازی را وارد کرده و کد OTP تولید شده را وارد کنید."
            ],
            "enabled" => [
                "title" => "شما احراز هویت دو عاملی را فعال کرده‌اید!",
                "description" => "احراز هویت دو عاملی هم‌اکنون فعال است. این کمک می‌کند تا حساب کاربری شما ایمن‌تر شود.",
                "store_codes" => "این کدهای بازیابی را در یک مدیر رمز عبور امن ذخیره کنید. آنها می‌توانند برای بازیابی دسترسی به حساب کاربری شما در صورت گم شدن دستگاه احراز هویت دو عاملی استفاده شوند.",
                "show_codes" => "نمایش کدهای بازیابی",
                "hide_codes" => "پنهان کردن کدهای بازیابی"
            ],
            "confirmation" => [
                "success_notification" => "کد تأیید شد. احراز هویت دو عاملی فعال شد.",
                "invalid_code" => "کد وارد شده نامعتبر است."
            ]
        ],
        "sanctum" => [
            "title" => "توکن‌های API",
            "description" => "مدیریت توکن‌های API که به سرویس‌های شخص ثالث اجازه می‌دهند به این برنامه به نام شما دسترسی داشته باشند. توجه: توکن شما یک بار هنگام ایجاد نمایش داده می‌شود و در دیگر قسمت‌ها به دلایل امنیتی قابل بازیابی نیست."
        ]
    ]
];
