<?php

return [
    'login' => [
        'username_or_email' => 'Номи корбар ё суроғаи почтаи электронӣ',
        'forgot_password_link' => 'Рамзро фаромӯш кардед?',
        'create_an_account' => 'Эҷоди ҳисоб',
    ],
    'password_confirm' => [
        'heading' => 'Рамзро тасдиқ кунед',
        'description' => 'Барои анҷом додани ин амал, рамзи худро тасдиқ кунед.',
        'current_password' => 'Рамзи ҷорӣ',
    ],
    'two_factor' => [
        'heading' => 'Тасдиқи дуомила',
        'description' => 'Лутфан бо ворид кардани рамзи барномаи тасдиқкунӣ дастрасиро тасдиқ кунед',
        'code_placeholder' => 'XXX-XXX',
        'recovery' => [
            'heading' => 'Тасдиқи дуомила',
            'description' => 'Лутфан бо ворид кардани яке аз рамзҳои барқарорсозӣ дастрасӣ ба ҳисоби худро тасдиқ кунед.',
        ],
        'recovery_code_placeholder' => 'abcdef-98765',
        'recovery_code_text' => 'Дастгоҳро гум кардед?',
        'recovery_code_link' => 'Истифодаи рамзи барқарорсозӣ',
        'back_to_login_link' => 'Бозгашт ба саҳифаи воридшавӣ',
    ],
    'registration' => [
        'title' => 'Бақайдгирӣ',
        'heading' => 'Эҷоди ҳисоб',
        'submit' => [
            'label' => 'Фиристодан',
        ],
        'notification_unique' => 'Ҳисоб бо чунин суроға аллакай вуҷуд дорад. Лутфан ворид шавед.',
    ],
    'reset_password' => [
        'title' => 'Рамзро фаромӯш кардед',
        'heading' => 'Барқарор кардани рамз',
        'submit' => [
            'label' => 'Тасдиқ кардан',
        ],
        'notification_error' => 'Хато: лутфан баъдтар дубора кӯшиш кунед.',
        'notification_error_link_text' => 'Дубора кӯшиш кунед',
        'notification_success' => 'Барои дастурҳои минбаъда паёмдони худро санҷед!',
    ],
    'verification' => [
        'title' => 'Тасдиқи почтаи электронӣ',
        'heading' => 'Тасдиқи суроғаи почтаи электронӣ лозим аст',
        'submit' => [
            'label' => 'Баромадан',
        ],
        'notification_success' => 'Барои дастурҳо паёмдони худро санҷед',
        'notification_resend' => 'Паёми тасдиқ дубора фиристода шуд.',
        'before_proceeding' => 'Пеш аз идома додан, паёми электронии худро барои пайванди тасдиқ санҷед.',
        'not_receive' => 'Агар шумо паёми электронӣ нагирифта бошед,',
        'request_another' => 'барои фиристодани дубора ин ҷо пахш кунед.',
    ],
    'profile' => [
        'account' => 'Ҳисоб',
        'profile' => 'Профил',
        'my_profile' => 'Профили ман',
        'personal_info' => [
            'heading' => 'Маълумоти шахсӣ',
            'subheading' => 'Идоракунии маълумоти шахсии шумо',
            'submit' => [
                'label' => 'Навсозӣ кардан',
            ],
            'notify' => 'Профил бомуваффақият навсозӣ шуд',
        ],
        'password' => [
            'heading' => 'Рамз',
            'subheading' => 'Бояд ҳадди ақал 8 аломат дошта бошад.',
            'submit' => [
                'label' => 'Навсозӣ кардан',
            ],
            'notify' => 'Рамз бомуваффақият навсозӣ шуд',
        ],
        '2fa' => [
            'title' => 'Тасдиқи дуомила',
            'description' => 'Идоракунии тасдиқи дуомила барои ҳисоби шумо (тавсия мешавад)',
            'actions' => [
                'enable' => 'Фаъол кардан',
                'regenerate_codes' => 'Эҷод кардани рамзҳои нав',
                'disable' => 'Ғайрифаъол кардан',
                'confirm_finish' => 'Тасдиқ ва анҷом',
                'cancel_setup' => 'Бекор кардан',
                'confirm' => 'Тасдиқ кардан',
            ],
            'setup_key' => 'Калиди танзим',
            'not_enabled' => [
                'title' => 'Шумо тасдиқи дуомиларо фаъол накардаед',
                'description' => 'Агар тасдиқи дуомила фаъол бошад, ҳангоми воридшавӣ аз шумо рамзи амниятӣ талаб карда мешавад. Шумо метавонед онро аз Google Authenticator дастрас намоед.',
            ],
            'finish_enabling' => [
                'title' => 'Фаъолсозии тасдиқи дуомиларо анҷом диҳед.',
                'description' => 'Барои анҷом додани фаъолсозӣ QR-рамзро бо барномаи тасдиқкунӣ скан кунед ё калиди танзимро ворид намоед.',
            ],
            'enabled' => [
                'title' => 'Шумо тасдиқи дуомиларо фаъол кардед',
                'description' => 'Тасдиқи дуомила фаъол шуд. QR-рамзи зеринро бо барномаи тасдиқкунӣ дар телефони худ скан кунед ё калиди танзимро ворид намоед.',
                'store_codes' => 'Ин рамзҳои барқарорсозиро дар ҷои бехатар нигоҳ доред. Агар дастгоҳи тасдиқи дуомиларо гум кунед, метавонед онҳоро барои барқарор кардани дастрасӣ истифода баред.',
                'show_codes' => 'Намоиши рамзҳои барқарорсозӣ',
                'hide_codes' => 'Пинҳон кардани рамзҳои барқарорсозӣ',
            ],
            'confirmation' => [
                'success_notification' => 'Рамз тасдиқ шуд. Тасдиқи дуомила фаъол гардид.',
                'invalid_code' => 'Рамзи воридшуда нодуруст аст.',
            ],
        ],
        'sanctum' => [
            'title' => 'Токенҳои API',
            'description' => 'Идоракунии токенҳои API, ки ба хизматрасониҳои дигар имкон медиҳанд аз номи шумо ба ин барнома дастрасӣ пайдо кунанд. ЭЗОҲ: токен танҳо як маротиба ҳангоми эҷод нишон дода мешавад. Агар онро гум кунед, бояд онро нест карда, токени нав эҷод намоед.',
            'create' => [
                'notify' => 'Токен бомуваффақият эҷод шуд',
                'submit' => [
                    'label' => 'Эҷод кардан',
                ],
            ],
            'update' => [
                'notify' => 'Токен бомуваффақият навсозӣ шуд',
            ],
        ],
    ],
    'clipboard' => [
        'link' => 'Нусхабардорӣ ба буфери мубодила',
        'tooltip' => 'Нусхабардорӣ шуд!',
    ],
    'fields' => [
        'email' => 'Почтаи электронӣ',
        'login' => 'Номи корбар',
        'name' => 'Ном',
        'password' => 'Рамз',
        'password_confirm' => 'Тасдиқи рамз',
        'new_password' => 'Рамзи нав',
        'new_password_confirmation' => 'Тасдиқи рамзи нав',
        'token_name' => 'Номи токен',
        'abilities' => 'Дастрасӣ',
        '2fa_code' => 'Рамз',
        '2fa_recovery_code' => 'Рамзи барқарорсозӣ',
        'created' => 'Эҷод шудааст',
        'expires' => 'Ба анҷом мерасад',
    ],
    'permissions' => [
        'create' => 'Эҷод кардан',
        'view' => 'Намоиш',
        'update' => 'Навсозӣ',
        'delete' => 'Нест кардан',
    ],
    'or' => 'ё',
    'cancel' => 'Бекор кардан',
];
