<?php

return [
    'login' => [
        'username_or_email' => 'اسم المستخدم أو كلمة المرور',
        'forgot_password_link' => 'نسيت كلمة المرور؟',
        'create_an_account' => 'إنشاء حساب',
    ],
    'two_factor' => [
        'heading' => 'المصادقة الثنائية',
        'description' => 'الرجاء تأكيد الدخول إلى حسابك عبر إدخال رمز المصادقة الموضح في تطبيق التوثيق الخاص بك.',
        'code_placeholder' => 'XXX-XXX',
        'recovery' => [
            'heading' => 'المصادقة الثنائية',
            'description' => 'الرجاء تأكيد الدخول إلى حسابك عبر إدخال أحد رموز الاسترجاع  الخاصة بالحالات الطارئة.',
        ],
        'recovery_code_placeholder' => 'abcdef-98765',
        'recovery_code_text' => 'فقدت جهازك؟',
        'recovery_code_link' => 'استخدم رمز الاسترجاع',
        'back_to_login_link' => 'العودة إلى شاشة الدخول',
    ],
    'registration' => [
        'title' => 'تسجيل حساب',
        'heading' => 'إنشاء حساب جديد',
        'submit' => [
            'label' => 'تسجيل',
        ],
        'notification_unique' => 'لقد تم تسجيل هذا البريد الإليكتروني مسبقاً.',
    ],
    'reset_password' => [
        'title' => 'استعادة كلمة المرور',
        'heading' => 'استعادة كلمة المرور',
        'submit' => [
            'label' => 'أرسل',
        ],
        'notification_error' => 'عذراً، نرجو المحاولة مرة أخرى لاحقاً.',
        "notification_error_link_text"=>"Try Again",
        'notification_success' => 'تم إرسال التعليمات للبريد الإليكتروني الخاص بك!',
    ],
    'verification' => [
        'title' => 'التحقق من البريد الإليكتروني',
        'heading' => 'التحقق من البريد الإليكتروني مطلوب',
        'submit' => [
            'label' => 'تسجيل الخروج',
        ],
        'notification_success' => 'تم إرسال التعليمات للبريد الإليكتروني الخاص بك!',
        'notification_resend' => 'تم إعادة إرسال رابط التحقق لبريدك الإليكتروني.',
        'before_proceeding' => 'قبل المتابعة، يرجى التحقق من رابط التفعيل المرسل إلى بريدك الإليكتروني.',
        'not_receive' => 'إذا لم يصلك رابط التفعيل على بريدك الإليكتروني',
        'request_another' => 'اضغط هنا لإرسال رابط آخر.',
    ],
    'profile' => [
        'account' => 'الحساب',
        'profile' => 'الملف الشخصي',
        'my_profile' => 'ملفي الشخصي',
        'personal_info' => [
            'heading' => 'البيانات الشخصية',
            'subheading' => 'قم بإدارة بياناتك الشخصية.',
            'submit' => [
                'label' => 'تحديث',
            ],
            'notify' => 'تم تحديث بياناتك الشخصية بنجاح!',
        ],
        'password' => [
            'heading' => 'كلمة المرور',
            'subheading' => 'يجب أن تتألف كلمة المرور من 8 خانات على الأقل.',
            'submit' => [
                'label' => 'تحديث',
            ],
            'notify' => 'تم تحديث كلمة المرور بنجاح!',
        ],
        '2fa' => [
            'title' => 'المصادقة الثنائية',
            'description' => 'إدارة المصادقة الثنائية (موصى به).',
            'actions' => [
                'enable' => 'تفعيل',
                'regenerate_codes' => 'إعادة إنشاء الرموز',
                'disable' => 'إلغاء التفعيل',
                'confirm_finish' => 'تأكيد وإنهاء',
                'cancel_setup' => 'إلغاء الإعداد',
            ],
            'setup_key' => 'مفتاح الإعداد',
            'not_enabled' => [
                'title' => 'لم تقم بتفعيل المصادقة الثنائية.',
                'description' => "عند تفعيل المصادقة الثنائية، ستتم مطالبتك برمز آمن عشوائي أثناء المصادقة. يمكنك الحصول على هذا الرمز من خلال تطبيق Google Authenticator على هاتفك.",
            ],
            'finish_enabling' => [
                'title' => 'إنهاء تفعيل المصادقة الثنائية.',
                'description' => "لإنهاء تفعيل المصادقة الثنائية، قم بمسح رمز QR التالي مستخدماً تطبيق المصادقة على هاتفك أو بإدخال مفتاح الإعداد ومن ثم كتابة رمز OTP الذي تم إنشاؤه.",
            ],
            'enabled' => [
                'title' => 'لقد قمت بتفعيل المصادقة الثنائية!',
                'description' => "المصادقة الثنائية مفعّلة حالياً. قم بمسح رمز QR التالي عبر تطبيق المصادقة على هاتفك أو قم بإدخال مفتاح الإعداد.",
                'store_codes' => 'احتفظ برموز الاسترجاع في مدير كلمات مرور آمن. يمكن استخدام هذه الرموز لاستعادة الوصول إلى حسابك في حالة فقدان جهاز المصادقة الثنائية الخاص بك.',
                'show_codes' => 'عرض رموز الاسترجاع',
                'hide_codes' => 'إخفاء رموز الاسترجاع',
            ],
            'confirmation' => [
                'success_notification' => 'تم التحقق من الرمز وتفعيل المصادقة الثنائية.',
                'invalid_code' => 'الرمز الذي قمت بإدخاله غير صالح.',
            ],
        ],
        'sanctum' => [
            'title' => 'رموز API',
            'description' => 'إدارة رموز API التي تسمح لخدمات الطرف الثالث الإتصال بالتطبيق بالإنابة عنك. ملاحظة: يتم عرض الرمز مرة واحدة لحظة إنشائه. إذا فقدت رمزك، فسيتوجب عليك حذفه وإنشاء رمز جديد.',
            'create' => [
                'notify' => 'تم إنشاء الرمز بنجاح!',
                'submit' => [
                    'label' => 'Create',
                ],
            ],
            'update' => [
                'notify' => 'تم تحديث الرموز بنجاح!',
            ],
        ],
    ],
    'fields' => [
        'email' => 'البريد الإليكتروني',
        'login' => 'مستخدم',
        'name' => 'الإسم',
        'password' => 'كلمة المرور',
        'password_confirm' => 'تأكيد كلمة المرور',
        'new_password' => 'كلمة مرور جديدة',
        'new_password_confirmation' => 'تأكيد كلمة المرور الجديدة',
        'token_name' => 'اسم الرمز',
        'abilities' => 'القدرات',
        '2fa_code' => 'الرمز',
        '2fa_recovery_code' => 'رمز الاسترجاع',
    ],
    'or' => 'أو',
    'cancel' => 'إلغاء',
];
