<?php

return [
    'login' => [
        'username_or_email' => "Ім'я користувача або електронна пошта",
        'forgot_password_link' => 'Забули пароль?',
        'create_an_account' => 'Створити акаунт',
    ],
    'password_confirm' => [
        'heading' => 'Підтвердіть пароль',
        'description' => 'Щоб завершити цю дію, підтвердіть свій пароль.',
        'current_password' => 'Поточний пароль',
    ],
    'two_factor' => [
        'heading' => 'Двофакторна аутентифікація',
        'description' => 'Будь ласка, підтвердіть доступ, ввівши пароль із додатка',
        'code_placeholder' => 'XXX-XXX',
        'recovery' => [
            'heading' => 'Двофакторна аутентифікація',
            'description' => 'Будь ласка, підтвердіть доступ до вашого акаунту, ввівши один із кодів відновлення в екстрених випадках.',
        ],
        'recovery_code_placeholder' => 'abcdef-98765',
        'recovery_code_text' => 'Втратили пристрій?',
        'recovery_code_link' => 'Використати код відновлення',
        'back_to_login_link' => 'Повернутися на сторінку входу',
    ],
    'registration' => [
        'title' => 'Реєстрація',
        'heading' => 'Створити акаунт',
        'submit' => [
            'label' => 'Відправити',
        ],
        'notification_unique' => 'Акаунт з такою адресою вже існує. Будь ласка, увійдіть',
    ],
    'reset_password' => [
        'title' => 'Забули пароль',
        'heading' => 'Скинути пароль',
        'submit' => [
            'label' => 'Підтвердити',
        ],
        'notification_error' => 'Помилка: повторіть спробу пізніше.',
        'notification_error_link_text' => 'Спробуйте ще раз',
        'notification_success' => 'Перевірте свою поштову скриньку для отримання інструкцій!',
    ],
    'verification' => [
        'title' => 'Перевірити електронну пошту',
        'heading' => 'Потрібно підтвердити електронну пошту',
        'submit' => [
            'label' => 'Вийти',
        ],
        'notification_success' => 'Перевірте поштову скриньку для отримання інструкцій',
        'notification_resend' => 'Лист із підтвердженням було відправлено повторно.',
        'before_proceeding' => 'Перед тим, як продовжити, перевірте електронну пошту на наявність посилання для підтвердження.',
        'not_receive' => 'Якщо ви не отримали електронного листа,',
        'request_another' => 'Натисніть тут, щоб запросити повторно.',
    ],
    'profile' => [
        'account' => 'Акаунт',
        'profile' => 'Профіль',
        'my_profile' => 'Мій Профіль',
        'personal_info' => [
            'heading' => 'Особиста інформація',
            'subheading' => 'Управління вашою особистою інформацією',
            'submit' => [
                'label' => 'Оновити',
            ],
            'notify' => 'Профіль успішно оновлено',
        ],
        'password' => [
            'heading' => 'Пароль',
            'subheading' => 'Має містити щонайменше 8 символів.',
            'submit' => [
                'label' => 'Оновити',
            ],
            'notify' => 'Пароль успішно оновлено',
        ],
        '2fa' => [
            'title' => 'Двофакторна аутентифікація',
            'description' => 'Управління двофакторною аутентифікацією для вашого акаунта (рекомендується)',
            'actions' => [
                'enable' => 'Увімкнути',
                'regenerate_codes' => 'Регенерувати коди',
                'disable' => 'Вимкнути',
                'confirm_finish' => 'Підтвердити і завершити',
                'cancel_setup' => 'Скасувати',
            ],
            'setup_key' => 'Ключ налаштування',
            'not_enabled' => [
                'title' => 'Ви не ввімкнули двофакторну аутентифікацію',
                'description' => 'Якщо двофакторна аутентифікація ввімкнена, вам буде запропоновано ввести безпечний токен під час аутентифікації. Ви можете отримати цей токен із Google Authenticator',
            ],
            'finish_enabling' => [
                'title' => 'Завершіть активацію двофакторної аутентифікації.',
                'description' => 'Щоб завершити активацію двофакторної аутентифікації, відскануйте QR-код через додаток для аутентифікації або введіть ключ налаштування OTP-код',
            ],
            'enabled' => [
                'title' => 'Ви ввімкнули двофакторну аутентифікацію',
                'description' => 'Двофакторна аутентифікація тепер ввімкнена. Відскануйте наступний QR-код за допомогою додатка для аутентифікації на телефоні або введіть ключ налаштування',
                'store_codes' => 'Збережіть ці коди відновлення в безпечному менеджері паролів. Їх можна використовувати для відновлення доступу до вашого акаунта, якщо ваш пристрій для двофакторної аутентифікації загублено.',
                'show_codes' => 'Показати коди відновлення',
                'hide_codes' => 'Приховати коди відновлення',
            ],
            'confirmation' => [
                'success_notification' => 'Код підтверджено. Двофакторну аутентифікацію ввімкнено.',
                'invalid_code' => 'Введений вами код недійсний.',
            ],
        ],
        'sanctum' => [
            'title' => 'API Токени',
            'description' => 'Управління токенами API, які дозволяють стороннім службам отримувати доступ до цього додатка від вашого імені. УВАГА: Ваш токен відображається один раз під час створення. Якщо ви втратите свій токен, вам потрібно буде видалити його і створити новий',
            'create' => [
                'notify' => 'Токен успішно створено',
                'submit' => [
                    'label' => 'Створити',
                ],
            ],
            'update' => [
                'notify' => 'Токен успішно оновлено',
            ],
        ],
    ],
    'clipboard' => [
        'link' => 'Скопіювати в буфер обміну',
        'tooltip' => 'Скопійовано!',
    ],
    'fields' => [
        'email' => 'E-mail',
        'login' => 'Ім’я користувача',
        'name' => 'Ім’я',
        'password' => 'Пароль',
        'password_confirm' => 'Підтвердження пароля',
        'new_password' => 'Новий пароль',
        'new_password_confirmation' => 'Підтвердження нового пароля',
        'token_name' => 'Назва токена',
        'abilities' => 'Доступ',
        '2fa_code' => 'Код',
        '2fa_recovery_code' => 'Код відновлення',
        'created' => 'Створено',
        'expires' => 'Закінчується',
    ],
    'or' => 'або',
    'cancel' => 'Скасувати',
];
